#ifndef BUTTON_H
#define BUTTON_H
//=============================================================================
#include <avr/io.h>
#include <avr/interrupt.h>
#include <stdint.h>
//=============================================================================
#include "pins.h"
//=============================================================================
/* Handling long press actions */
#define SHORT_PRESS				100
#define LONG_PRESS				600
//=============================================================================
// пользовательские функции 
// инициализация. 
// вызывается в начале программы
void KBD_init(void);
// опрос кнопок/входов. вызывается периодически
void KBD_poll(void);
//=============================================================================
#endif //BUT_H

