#ifndef	ENCODER_H
#define	ENCODER_H
#include <avr/io.h>
//=============================================================================
// порт и выводы к которым подключен энкодер
#define ENC_PORT 		PORTD 	
#define ENC_PIN 		PIND
#define ENC_DDR 		DDRD
#define ENC_PIN1 		1
#define ENC_PIN2 		2
//=============================================================================
#define num_of_st    	2                             // количество состояний на один "щелчок"
#define state_0      	0x00                          // состояние выводов 0 энкодера
#define state_1      	_BV(ENC_PIN1)                 // состояние выводов 1 энкодера
#define state_2      	_BV(ENC_PIN2)                 // состояние выводов 2 энкодера
#define state_3      	_BV(ENC_PIN2) + _BV(ENC_PIN1) //состояние выводов 3 энкодера
//=============================================================================
void ENC_init(void);
void ENC_poll(void);
//=============================================================================
#endif  
